04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleFluid/planarPoiseuille/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc residuals(p, sigma)
#includeFunc graphCell(name=graph, start=(0 0 0), end=(0 1 0), U)
#includeFunc probes(name=probes, points=((0 1 0)), U)

// ************************************************************************* //
